; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v3)
             (pred_4 ?v4 ?v8)
             (pred_3 ?v13 ?v8)
             (pred_10 ?v5 ?v13 )
	     (pred_5 ?v13)
             (pred_12 ?v11)
             (pred_7 ?v4)
             (pred_1 ?v8)
             (pred_2 ?v13)
             (pred_11 ?v4)
             (pred_8 ?v13)
             (pred_9 ))



(:action op_2
:parameters (?v7 ?v9 ?v6 ?v12)
:precondition (and (pred_12 ?v7) (pred_12 ?v9) (pred_7 ?v6) (pred_1 ?v12)
          (pred_6 ?v7 ?v9) (pred_4 ?v6 ?v12)
                   (pred_3 ?v9 ?v12) (pred_5 ?v7) 
                   (pred_2 ?v9) (pred_11 ?v6))
:effect (and  (pred_8 ?v9) (not (pred_2 ?v9))))


(:action op_1
:parameters (?v7 ?v2)
:precondition (and (pred_12 ?v7) (pred_12 ?v2)
               (pred_5 ?v7) (pred_6 ?v7 ?v2) (pred_8 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v7))))

(:action op_3
:parameters (?v7 ?v6)
:precondition (and (pred_12 ?v7) (pred_7 ?v6) 
                  (pred_5 ?v7) (pred_10 ?v6 ?v7) (pred_9 ))
:effect (and (pred_11 ?v6)
   (not (pred_10 ?v6 ?v7)) (not (pred_9 ))))


(:action op_4
:parameters (?v7 ?v10 ?v1)
:precondition (and (pred_12 ?v7) (pred_7 ?v10) (pred_7 ?v1)
                  (pred_5 ?v7) (pred_11 ?v1) (pred_10 ?v10 ?v7))
:effect (and (pred_11 ?v10) (pred_10 ?v1 ?v7)
        (not (pred_11 ?v1)) (not (pred_10 ?v10 ?v7))))

(:action op_5
:parameters (?v7 ?v6)
:precondition (and (pred_12 ?v7) (pred_7 ?v6) 
                  (pred_5 ?v7) (pred_11 ?v6))
:effect (and (pred_9 ) (pred_10 ?v6 ?v7) (not (pred_11 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_17 obj_03 obj_20 obj_02 obj_12 obj_19 obj_22 obj_04 obj_15 obj_14 obj_05 obj_10 obj_11 obj_21 obj_08
    obj_09 obj_06 obj_16
    obj_07 obj_13 obj_01
    )

    (:init
       (pred_9)

       (pred_12 obj_18)
       (pred_12 obj_17)
       (pred_12 obj_03)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_12)
       (pred_12 obj_19)
       (pred_12 obj_22)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_21)
       (pred_12 obj_08)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_7 obj_01)

       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_17 obj_12)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_03 obj_19)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_17)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_22 obj_05)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_19)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_14 obj_21)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_21 obj_08)
       (pred_6 obj_21 obj_14)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_21)
       (pred_2 obj_04)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_3  obj_04 obj_09)
       (pred_3  obj_17 obj_06)
       (pred_3  obj_02 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_19)
       (pred_8 obj_22)
       (pred_8 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_11)
       (pred_8 obj_21)
       (pred_8 obj_08)

       (pred_4  obj_07 obj_09)
       (pred_4  obj_13 obj_06)
       (pred_4  obj_01 obj_16)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_01 obj_08)
       (pred_5 obj_20)
    )

    (:goal (and
       (pred_10 obj_07 obj_12)
       (pred_10 obj_13 obj_17)
       (pred_10 obj_01 obj_11)
    ))
(:constraints
  (always (not (pred_5 obj_21)))
)
)

; plan
1. (op_3 obj_20 obj_13)
   deleted: (pred_10 obj_13 obj_20) (pred_9)
   added: (pred_11 obj_13)
   goals met: 0 of 3
2. (op_1 obj_20 obj_03)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_03)
   goals met: 0 of 3
3. (op_2 obj_03 obj_17 obj_13 obj_06)
   deleted: (pred_2 obj_17)
   added: (pred_8 obj_17)
   goals met: 0 of 3
4. (op_1 obj_03 obj_17)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_17)
   goals met: 0 of 3
5. (op_1 obj_17 obj_12)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_12)
   goals met: 0 of 3
6. (op_5 obj_12 obj_13)
   deleted: (pred_11 obj_13)
   added: (pred_9) (pred_10 obj_13 obj_12)
   goals met: 0 of 3
7. (op_1 obj_12 obj_15)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_15)
   goals met: 0 of 3
8. (op_1 obj_15 obj_11)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_11)
   goals met: 0 of 3
9. (op_1 obj_11 obj_10)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_10)
   goals met: 0 of 3
10. (op_3 obj_10 obj_07)
   deleted: (pred_10 obj_07 obj_10) (pred_9)
   added: (pred_11 obj_07)
   goals met: 0 of 3
11. (op_1 obj_10 obj_11)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_11)
   goals met: 0 of 3
12. (op_1 obj_11 obj_15)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_15)
   goals met: 0 of 3
13. (op_1 obj_15 obj_12)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_12)
   goals met: 0 of 3
14. (op_4 obj_12 obj_13 obj_07)
   deleted: (pred_11 obj_07) (pred_10 obj_13 obj_12)
   added: (pred_11 obj_13) (pred_10 obj_07 obj_12)
   goals met: 1 of 3
15. (op_1 obj_12 obj_15)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_15)
   goals met: 1 of 3
16. (op_1 obj_15 obj_14)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_14)
   goals met: 1 of 3
17. (op_1 obj_14 obj_05)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_05)
   goals met: 1 of 3
18. (op_5 obj_05 obj_13)
   deleted: (pred_11 obj_13)
   added: (pred_9) (pred_10 obj_13 obj_05)
   goals met: 1 of 3
19. (op_1 obj_05 obj_08)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_08)
   goals met: 1 of 3
20. (op_3 obj_08 obj_01)
   deleted: (pred_10 obj_01 obj_08) (pred_9)
   added: (pred_11 obj_01)
   goals met: 1 of 3
21. (op_1 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_05)
   goals met: 1 of 3
22. (op_1 obj_05 obj_14)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_14)
   goals met: 1 of 3
23. (op_1 obj_14 obj_15)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_15)
   goals met: 1 of 3
24. (op_1 obj_15 obj_11)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_11)
   goals met: 1 of 3
25. (op_5 obj_11 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_9) (pred_10 obj_01 obj_11)
   goals met: 2 of 3
26. (op_1 obj_11 obj_15)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_15)
   goals met: 2 of 3
27. (op_1 obj_15 obj_14)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_14)
   goals met: 2 of 3
28. (op_1 obj_14 obj_05)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_05)
   goals met: 2 of 3
29. (op_3 obj_05 obj_13)
   deleted: (pred_10 obj_13 obj_05) (pred_9)
   added: (pred_11 obj_13)
   goals met: 2 of 3
30. (op_1 obj_05 obj_22)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_22)
   goals met: 2 of 3
31. (op_1 obj_22 obj_20)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_20)
   goals met: 2 of 3
32. (op_1 obj_20 obj_03)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_03)
   goals met: 2 of 3
33. (op_1 obj_03 obj_17)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_17)
   goals met: 2 of 3
34. (op_5 obj_17 obj_13)
   deleted: (pred_11 obj_13)
   added: (pred_9) (pred_10 obj_13 obj_17)
   goals met: 3 of 3
